; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared4 - mode
	thermograph1 - mode
	spectrograph2 - mode
	image3 - mode
	infrared5 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	Star4 - direction
	GroundStation1 - direction
	Star3 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared5)
	(supports instrument1 image3)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared5)
	(calibration_target instrument2 Star8)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
)
(:goal (and
	(pointing satellite1 Phenomenon11)
	(have_image Phenomenon9 infrared4)
	(have_image Phenomenon9 thermograph1)
	(have_image Phenomenon10 image3)
	(have_image Phenomenon10 spectrograph0)
	(have_image Phenomenon11 infrared5)
	(have_image Phenomenon11 spectrograph0)
	(have_image Star12 infrared5)
	(have_image Phenomenon13 infrared5)
	(have_image Phenomenon14 infrared4)
))

)

; plan
1. (turn_to satellite1 star8 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star8)
   goals met: 0 of 10
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 10
3. (calibrate satellite1 instrument2 star8)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon13 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon13)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon13 instrument2 infrared5)
   added: (have_image phenomenon13 infrared5)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 10
7. (turn_to satellite0 star4 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star4)
   goals met: 1 of 10
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 10
9. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 1 of 10
10. (take_image satellite1 phenomenon10 instrument2 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 2 of 10
11. (turn_to satellite0 phenomenon14 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 10
12. (take_image satellite0 phenomenon14 instrument0 infrared4)
   added: (have_image phenomenon14 infrared4)
   goals met: 3 of 10
13. (turn_to satellite0 phenomenon9 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 10
14. (take_image satellite0 phenomenon9 instrument0 infrared4)
   added: (have_image phenomenon9 infrared4)
   goals met: 4 of 10
15. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 10
16. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 10
17. (turn_to satellite0 groundstation1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 10
18. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 4 of 10
19. (turn_to satellite0 phenomenon10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 10
20. (take_image satellite0 phenomenon10 instrument1 image3)
   added: (have_image phenomenon10 image3)
   goals met: 5 of 10
21. (turn_to satellite0 phenomenon9 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 10
22. (take_image satellite0 phenomenon9 instrument1 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 6 of 10
23. (turn_to satellite0 star12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star12)
   goals met: 6 of 10
24. (take_image satellite0 star12 instrument1 infrared5)
   added: (have_image star12 infrared5)
   goals met: 7 of 10
25. (turn_to satellite1 phenomenon11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon11)
   goals met: 8 of 10
26. (take_image satellite1 phenomenon11 instrument2 infrared5)
   added: (have_image phenomenon11 infrared5)
   goals met: 9 of 10
27. (take_image satellite1 phenomenon11 instrument2 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 10 of 10
